function [x_f, P_f]= filtsrcf_upd(Z,H,R,x,P)
%-------------------------------------------------------------------------------
% Function : Square-Rootフィルタ(観測更新)
%
% [argin]
% Z   : mx1 イノベーションベクトル: y-h(x^)
% H   : mxn 観測行列: 線形化した際の偏微分係数
% R   : mxm 観測雑音共分散行列
% x   : nx1 一段予測値
% P   : nxn 一段予測値の推定誤差共分散行列
%
% [argout]
% x_f : nx1 濾波推定値
% P_f : nxn 濾波推定値の推定誤差共分散行列
%
% Ritsumeikan Univ. EEE Sugimoto Lab. GPS Division
% S.Fujita: Oct. 21, 2007
%-------------------------------------------------------------------------------

% カルマンゲインの計算
%--------------------------------------------
C=chol(P)';
V=C'*H';
S=V'*V+R;
VS=V*inv(S);
K =C*VS;

% 濾波推定値の計算
%--------------------------------------------
x_f=x+K*Z;

% 推定誤差共分散行列の計算
%--------------------------------------------
Cu=C*chol(eye(length(VS*V'))-VS*V')';
P_f=Cu*Cu';
