function [mp1,mp2,lgl,lgp,lg1,lg2,mw,ionp,ionl] = obs_comb(data)
%-------------------------------------------------------------------------------
% Function : 線形結合------L1,L2帯の観測量の各種線形結合を計算
% 
% [argin]
% data : 観測データ
% 
% [argout]
% mp1  : Multipath 線形結合(L1)
% mp2  : Multipath 線形結合(L2)
% lgl  : 幾何学フリー線形結合(搬送波)
% lgp  : 幾何学フリー線形結合(コード)
% lg1  : 幾何学フリー線形結合(1周波)
% lg2  : 幾何学フリー線形結合(2周波)
% mw   : Melbourne-Wubbena 線形結合
% ionp : 電離層(lgpから算出)
% ionl : 電離層(lglから算出,Nを含む)
% 
% Ritsumeikan Univ. EEE Sugimoto Lab. GPS Division
% S.Fujita: August 1, 2007
%-------------------------------------------------------------------------------

% 定数(グローバル変数)
%--------------------------------------------
% global C f1 f2 lam1 lam2 OMGE MUe FF

%--- 定数
%--------------------------------------------
C=299792458;							% 光速
f1=1.57542e9;  lam1=C/f1;				% L1 周波数 & 波長
f2=1.22760e9;  lam2=C/f2;				% L2 周波数 & 波長

OMGE=7.2921151467e-5;					% WGS-84 採用地球回転角速度 [rad/s]
MUe=3.986005e14;						% WGS-84 の地心重力定数 [m^3s^{-2}]
FF=-4.442807633e-10;					% 相対論に関する誤差補正係数

pr=data(:,2);							% CA
pr2=data(:,6);							% PY
adr1=data(:,1);							% L1
adr2=data(:,5);							% L2

% Multipath 線形結合
%--------------------------------------------
mp1 = pr - (2*(f2^2/(f1^2-f2^2))+1)*lam1*adr1...
		 + 2*(f2^2/(f1^2-f2^2))*lam2*adr2;
mp2 = pr2 - 2*(f1^2/(f1^2-f2^2))*lam1*adr1...
		 + (2*(f1^2/(f1^2-f2^2))-1)*lam2*adr2;

% 幾何学フリー線形結合
%--------------------------------------------
lgl = lam1*adr1 - lam2*adr2;
lgp = pr - pr2;
lg1 = pr-lam1*adr1;
lg2 = pr2-lam2*adr2;
ionp = lgp/(1-f1^2/f2^2);
ionl = -lgl/(1-f1^2/f2^2);

% ワイドレーン線形結合
%--------------------------------------------
wl = (1/(1/lam1-1/lam2))*(adr1-adr2);

% ナローレーン線形結合
%--------------------------------------------
nl = (1/(1/lam1+1/lam2))*(adr1+adr2);

% Melbourne-Wubbena 線形結合
%--------------------------------------------
np = (1/(1/lam1+1/lam2))*(pr/lam1+pr2/lam2);
mw = wl - np;

