function [tide_xyz]=tide(sta,time)
%-------------------------------------------------------------------------------
% Function : 地球潮汐による移動距離を求める(XYZ)
%
% [argin]
% sta  : Kalx_f(1:3)受信機位置XYZ(EECF) [m]
% time : Modified Julian Date
% 
% [argout]
% tide_xyz(1:3) : 潮汐による変動 X, Y, Z [m]
%
% サブ関数化と引数の変更(by Yanase)
% 
% Ritsumeikan Univ. EEE Sugimoto Lab. GPS Division
% K.Nishikawa: Aug. 4, 2009
%-------------------------------------------------------------------------------

%--- 受信機までのベクトルと地心距離
%--------------------------------------------
r_stav=sta(1,1:3)/1000;										% 受信機までの地心距離ベクトル(km)
r_sta=sqrt(sta(1,1)^2+sta(1,2)^2+sta(1,3)^2)/1000;			% 受信機までの地心距離(km)

%--- 単位ベクトル計算
%--------------------------------------------
[r_mv,r_m,r_sv,r_s] = geocent_mix(time);
r_muv=r_mv/r_m;												% 月までの地心距離単位ベクトル
r_suv=r_sv/r_s;												% 太陽までの地心距離単位ベクトル
r_stauv=r_stav/r_sta;										% 受信機までの地心距離単位ベクトル

%--- 内積計算
%--------------------------------------------
dotmoon=dot(r_muv,r_stauv(1,1:3));							% 月と受信機の単位ベクトルの内積
dotsun=dot(r_suv,r_stauv(1,1:3));							% 太陽と受信機の単位ベクトルの内積

%--- 受信機の緯度計算
%--------------------------------------------
llh(1,1:3)=xyz2llh(sta(1,1:3)).*[180/pi 180/pi 1];			% llh(1,1)=受信機の緯度

%--- ラブ数、志田数 (IERS Conventions 2003 (P.79))
%--------------------------------------------
h2=0.6078-0.0006*((3*(sind(llh(1,1)))^2-1)/2);				% ラブ数(degree 2)
l2=0.0847+0.0002*((3*(sind(llh(1,1)))^2-1)/2);				% 志田数(degree 2)
h3=0.292;													% ラブ数(degree 3)
l3=0.015;													% 志田数(degree 3)

%--- 定数設定 (Satellite Orbits(見返し))
%--------------------------------------------
GMj=[398600.4415 4902.801 1.32712440018*10^11];				% 重力定数*[地球の質量 月の質量 太陽の質量]
Rj=[6378.137 0 0; r_muv; r_suv];							% [地球の赤道半径; 月距離単位ベクトル; 太陽距離単位ベクトル]
Rj0=[0 r_m r_s];											% [0 月距離 太陽距離]
Rj_r=[0 dotmoon dotsun];									% [0 月内積 太陽内積]
r_tide=[0 0 0];												% 初期値設定

%--- 潮汐計算 (IERS Conventions 2003 (P.79))
%--------------------------------------------
for j=2:3													% j=2は月、j=3は太陽の影響の計算
	r_tide1=((GMj(1,j)*Rj(1,1)^4)/(GMj(1,1)*Rj0(1,j)^3))...
			*(h2*r_stauv*((3/2)*Rj_r(1,j)^2-(1/2))+3*l2*Rj_r(1,j)*(Rj(j,1:3)-Rj_r(1,j)*r_stauv))...
			+((GMj(1,j)*Rj(1,1)^5)/(GMj(1,1)*Rj0(1,j)^4))...
			*(h3*r_stauv*((5/2)*Rj_r(1,j)^3-(3/2)*Rj_r(1,j))+l3*(15/2*Rj_r(1,j)^2-3/2)*(Rj(j,1:3)-Rj_r(1,j)*r_stauv));
	r_tide=r_tide+r_tide1;
end


r_tide=r_tide*1000;											% km → m

tide_xyz=[r_tide];



%-------------------------------------------------------------------------------
% 以下, サブルーチン

function [r_mv,r_m,r_sv,r_s]=geocent_mix(time)
%-------------------------------------------------------------------------------
% Function : 月と太陽の地心距離
%
% [argin]
% time : Modified Julian Date
% 
% [argout]
% r_mv : 月との地心距離ベクトル(XYZ)
% r_m  : 月の地心距離
% r_sv : 太陽との地心距離ベクトル(XYZ)
% r_s  : 太陽の地心距離
% 
% Ritsumeikan Univ. EEE Sugimoto Lab. GPS Division
% K.Nishikawa, T.Nagano: Jan. 31, 2010
%-------------------------------------------------------------------------------

%--------------------------------------------
%--- J2000(世紀)の時刻系に変換する
%--------------------------------------------

%--- グレゴリオ暦 → J2000(世紀)
%--------------------------------------------
%y=fix(time/100000000);
%m=fix(time/1000000-y*100);
%d=fix(time/10000-y*10000-m*100);
%h=fix(time/100-y*1000000-m*10000-d*100);
%mi=fix(time-y*100000000-m*1000000-d*10000-h*100);

%if m<3
%	m=m+12;
%	y=y-1;
%end

%y1=fix(365.25*y);
%y2=fix(y/400);
%y3=fix(y/100);
%m1=fix(30.59*(m-2));
%d1=d-0.5;
%h1=h/24;
%mi1=mi/60/24;

%t=(y1+y2-y3+m1+d1+h1+mi1-730456)/36525;

%--- 修正ユリウス日(MJD) → J2000(世紀)
%--------------------------------------------
t=(time-51544.5)/36525;							%J2000(世紀)



%--- 定数  Satellite Orbits (P.72)
%--------------------------------------------
L_0=218.31617+481267.88088*t-1.3972*t;			%月の平均黄経
l=134.96292+477198.86753*t;						%月の平均近点角
lp=357.52543+35999.04944*t;						%太陽の平均近点角
F=93.27283+483202.01873*t;						%昇交点からの月の平均角距離
D=297.85027+445267.11135*t;						%太陽と月の平均黄経の差

%--------------------------------------------
%--- 月の地心距離を求める
%--------------------------------------------

%--- 地心距離計算  Satellite Orbits (P.72)
%--------------------------------------------
r_m=385000-20905*cosd(l)-3699*cosd(2*D-l)...
-2956*cosd(2*D)-570*cosd(2*l)+246*cosd(2*l-2*D)...
-205*cosd(lp-2*D)-171*cosd(l+2*D)...
-152*cosd(l+lp-2*D);


%--------------------------------------------
%--- 月の黄経を求める
%--------------------------------------------

%--- 黄経計算  Satellite Orbits (P.72)
%--------------------------------------------
lam_m=L_0+22640/3600*sind(l)+769/3600*sind(2*l)-4586/3600*sind(l-2*D)...
+2370/3600*sind(2*D)-688/3600*sind(lp)-412/3600*sind(2*F)-212/3600*sind(2*l-2*D)...
-206/3600*sind(l+lp-2*D)+192/3600*sind(l+2*D)-165/3600*sind(lp-2*D)...
+148/3600*sind(l-lp)-125/3600*sind(D)-110/3600*sind(l+lp)-55/3600*sind(2*F-2*D);
lam_m=lam_m+1.3972*t;									%地球の歳差運動(P.71)

%--- 黄緯計算  Satellite Orbits (P.72)
%--------------------------------------------
bet_m=18520/3600*sind(F+lam_m-L_0+412/3600*sind(2*F)+541/3600*sind(lp))...
-526/3600*sind(F-2*D)+44/3600*sind(l+F-2*D)...
-31/3600*sind(-l+F-2*D)-25/3600*sind(-2*l+F)...
-23/3600*sind(lp+F-2*D)+21/3600*sind(-l+F)...
+11/3600*sind(-lp+F-2*D);


%--------------------------------------------
%--- 月との地心距離ベクトル(XYZ)
%--------------------------------------------

%--- 定数  Satellite Orbits (P.71)
%--------------------------------------------
OBL=23.43929111;													%黄道傾斜角(3.44)

%--- ベクトルに変換  Satellite Orbits (P.72)
%--------------------------------------------
Rx=[1 0 0 ; 0 cosd(-OBL) sind(-OBL) ; 0 -sind(-OBL) cosd(-OBL)];	%(P.345)
rm1=[r_m*cosd(lam_m)*cosd(bet_m);r_m*sind(lam_m)*cosd(bet_m);r_m*sind(bet_m)];
rm2=Rx*rm1;															%(3.51)

%--- 時角を計算  Satellite Orbits (P.33)
%--------------------------------------------
ghad=280.46061837504+360.9856473662862*j2000(time)*36525;			%グリニッジ時角(2.85)
Rz=[cosd(ghad) sind(ghad) 0 ; -sind(ghad) cosd(ghad) 0 ; 0 0 1 ];	%(P.345)
rm=Rz*rm2;
r_mv=[rm(1,1) rm(2,1) rm(3,1)];



%--------------------------------------------
%--- 太陽の地心距離を求める
%--------------------------------------------

%--- 定数  Satellite Orbits (P.71)
%--------------------------------------------
M=357.5256+35999.049*t;							%太陽の平均近点角

%--- 地心距離計算  Satellite Orbits (P.71)
%--------------------------------------------
r_s=(149.619-2.499*cosd(M)-0.021*cosd(2*M))*10^6;


%--------------------------------------------
%--- 太陽の黄経を求める
%--------------------------------------------

%--- 定数  Satellite Orbits (P.71)
%--------------------------------------------
omg=282.9400;									%昇交点+近日点角
M=357.5256+35999.049*t;							%太陽の平均近点角

%--- 黄経計算  Satellite Orbits (P.71)
%--------------------------------------------
lam_s=omg+M+6892/3600*sind(M)+72/3600*sind(2*M);	%(3.43)

lam_s=lam_s+1.3972*t;								%地球の歳差運動


%--------------------------------------------
%--- 太陽との地心距離ベクトル(XYZ)
%--------------------------------------------

%--- ベクトルに変換  Satellite Orbits (P.71)
%--------------------------------------------
r1=r_s*cosd(lam_s);										%(3.46)
r2=r_s*sind(lam_s)*cosd(OBL);							%(3.46)
r3=r_s*sind(lam_s)*sind(OBL);							%(3.46)

%--- 時角を計算  Satellite Orbits (P.33)
%--------------------------------------------
ghad=280.46061837504+360.9856473662862*t*36525;			%グリニッジ時角(2.85)
Rz=[cosd(ghad) sind(ghad) 0 ; -sind(ghad) cosd(ghad) 0 ; 0 0 1 ];	%(P.345)
rs=Rz*[r1;r2;r3];
r_sv=[rs(1,1) rs(2,1) rs(3,1)];

